[
    {
        "bookId": 1,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "https://i.ibb.co/BZHg3hj/The-Silent-Patient.webp",
        "review": "The Silent Patient by Alex Michaelides is a gripping psychological thriller that keeps readers on the edge of their seats from beginning to end. The story revolves around Alicia Berenson, a talented painter who seemingly inexplicably murders her husband and then stops speaking, rendering herself unreachable. Theo Faber, a psychotherapist fascinated by Alicia's case, becomes determined to unravel the mystery behind her silence. Michaelides skillfully weaves a narrative filled with twists and turns, keeping the reader guessing at every turn. The character development is rich, with each revelation shedding new light on Alicia's enigmatic persona and Theo's own troubled past.",
        "totalPages": 336,
        "rating": 4.6,
        "category": "Thriller",
        "tags": ["Psychological", "Mystery", "Suspense"],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "bookId": 2,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "https://i.ibb.co/DYvwyDY/The-Night-Circus.jpg",
        "review": "The Night Circus by Erin Morgenstern is a mesmerizing tale of magic, love, and destiny set in a mysterious and enchanting circus that only appears at night. Morgenstern's prose is lyrical and evocative, painting vivid images of the circus's wonders and the lives of its performers. At the heart of the story are Celia Bowen and Marco Alisdair, two young illusionists bound by a competition orchestrated by their mentors. As their rivalry transforms into a deep and forbidden love, they must navigate the complexities of their magical world and the dangerous game they are forced to play. The novel is a celebration of imagination and the power of storytelling, captivating readers with its dreamlike atmosphere and intricate plot.",
        "totalPages": 512,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Magic", "Romance", "Adventure"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 3,
        "bookName": "The Goldfinch",
        "author": "Donna Tartt",
        "image": "https://i.ibb.co/ZXjpKFD/The-Goldfinch.png",
        "review": "The Goldfinch by Donna Tartt is an epic tale of loss, redemption, and the transformative power of art. The story follows Theo Decker, who survives a tragic terrorist attack at the Metropolitan Museum of Art that kills his mother. In the chaos that ensues, Theo steals a priceless painting, 'The Goldfinch,' setting off a chain of events that shape the course of his life. Tartt's prose is lush and immersive, drawing readers into Theo's world as he navigates grief, addiction, and the pursuit of identity. The novel is a sprawling masterpiece that spans continents and decades, exploring themes of fate, morality, and the enduring value of beauty.",
        "totalPages": 771,
        "rating": 4.5,
        "category": "Literary Fiction",
        "tags": ["Art", "Coming-of-Age", "Drama"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 2013
    },
    {
        "bookId": 4,
        "bookName": "The Martian",
        "author": "Andy Weir",
        "image": "https://i.ibb.co/Tc60Tvc/The-Martian.webp",
        "review": "The Martian by Andy Weir is a riveting science fiction novel that combines suspense, humor, and ingenuity in a thrilling survival story set on the Red Planet. Mark Watney, an astronaut, is presumed dead and left behind by his crew during a mission to Mars. Alone and with limited resources, Watney must rely on his scientific knowledge and resourcefulness to survive while awaiting rescue. Weir's meticulous attention to scientific detail lends authenticity to the narrative, making the challenges Watney faces feel both harrowing and plausible. The novel is as much a celebration of human resilience and the spirit of exploration as it is a gripping adventure through the harsh landscape of Mars.",
        "totalPages": 369,
        "rating": 4.8,
        "category": "Science Fiction",
        "tags": ["Survival", "Adventure", "Space"],
        "publisher": "Crown Publishers",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 5,
        "bookName": "Gone Girl",
        "author": "Gillian Flynn",
        "image": "https://i.ibb.co/c3pQSCS/Gone-Girl.jpg",
        "review": "Gone Girl by Gillian Flynn is a dark and twisted psychological thriller that keeps readers guessing until the very end. The novel follows the mysterious disappearance of Amy Dunne on her fifth wedding anniversary, with all signs pointing to her husband Nick as the prime suspect. As the investigation unfolds, Flynn skillfully unravels layers of deceit, revealing the complexities of marriage and the dark secrets that lurk beneath the surface. The narrative is told from alternating perspectives, adding depth to the characters and constantly shifting the reader's perceptions. Flynn's razor-sharp prose and unpredictable plot twists make Gone Girl a compelling and unforgettable read.",
        "totalPages": 432,
        "rating": 4.6,
        "category": "Mystery",
        "tags": ["Marriage", "Deception", "Suspense"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2012
    },
    {
        "bookId": 6,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co/prz2Drf/The-Alchemist-2.webp",
        "review": "The Alchemist by Paulo Coelho is a timeless fable about following one's dreams and discovering the true meaning of life. The story follows Santiago, a shepherd boy who embarks on a journey across the desert in search of a hidden treasure. Along the way, Santiago encounters various characters who impart wisdom and guidance, leading him to realize that the treasure he seeks is not material wealth but a deeper understanding of himself and the universe. Coelho's prose is simple yet profound, filled with allegory and symbolism that resonate with readers on a spiritual level. The Alchemist inspires readers to pursue their passions, embrace life's challenges, and trust in the power of their own dreams.",
        "totalPages": 208,
        "rating": 4.7,
        "category": "Fable",
        "tags": ["Philosophical", "Adventure", "Spirituality"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 7,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/Xs8Jn25/Pride-Prejudice.webp",
        "review": "Pride and Prejudice by Jane Austen is a beloved classic that continues to enchant readers with its wit, romance, and social commentary. Set in the English countryside during the Regency era, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love and marriage in a society governed by strict social norms. Austen's sharp observations of human nature and her keen understanding of the dynamics between men and women make for a delightful and engaging read. From the iconic love-hate relationship between Elizabeth and Mr. Darcy to the colorful cast of characters that populate the novel, Pride and Prejudice is a true literary gem that has stood the test of time.",
        "totalPages": 432,
        "rating": 4.8,
        "category": "Romantic Fiction",
        "tags": ["Regency Era", "Satire", "Relationships"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 8,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/3yNYwwJ/to-kill-mockingbird.jpg",
        "review": "To Kill a Mockingbird by Harper Lee is a timeless masterpiece that explores themes of racial injustice, morality, and compassion in the American South. Set in the fictional town of Maycomb, Alabama, during the 1930s, the novel follows young Scout Finch as she grapples with the complexities of adulthood and witnesses her father, Atticus Finch, defend a black man falsely accused of raping a white woman. Lee's poignant prose and indelible characters, including the enigmatic Boo Radley and the wise Atticus, make for a powerful and thought-provoking read that resonates with readers of all ages.",
        "totalPages": 281,
        "rating": 4.7,
        "category": "Classic Fiction",
        "tags": ["Race", "Morality", "Southern Gothic"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 9,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/L1Yc3nP/The-Hobbit.jpg",
        "review": "The Hobbit by J.R.R. Tolkien is a timeless adventure that introduces readers to the enchanting world of Middle-earth. Bilbo Baggins, a hobbit of the Shire, embarks on a journey to reclaim the lost kingdom of Erebor from the dragon Smaug. Along the way, he encounters trolls, goblins, and other creatures, and discovers a magical ring that will shape the fate of Middle-earth. Tolkien's richly imagined world, populated by dwarves, elves, and wizards, is brought to life through his vivid descriptions and lyrical prose. The Hobbit is a tale of heroism, friendship, and the power of ordinary individuals to change the course of history.",
        "totalPages": 310,
        "rating": 4.7,
        "category": "Fantasy Fiction",
        "tags": ["Adventure", "Magic", "Quest"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    }
]
